import 𐳂𐳐𐳙𐳇𐳐𐳙𐳍𐳥 

𐳙𐳪𐳖𐳖: 𐲐𐳙𐳦
𐳙𐳪𐳖𐳖= 0

𐳺 : 𐲐𐳙𐳦
𐳺 = 1

𐳺𐳺𐳺 : 𐲐𐳙𐳦
𐳺𐳺𐳺 = 3

𐳻 : 𐲐𐳙𐳦
𐳻 = 5

𐳼𐳻 : 𐲐𐳙𐳦
𐳼𐳻 = 15

𐳌𐳐𐳯𐳯𐲂𐳪𐳯𐳯 : 𐲐𐳙𐳦 -> 𐲐𐲛 ()
𐳌𐳐𐳯𐳯𐲂𐳪𐳯𐳯 n = 𐳌𐳐𐳯𐳯𐲂𐳪𐳯𐳯𐲢𐳉𐳄 𐳺 n
    where
        𐳌𐳐𐳯𐳯𐲂𐳪𐳯𐳯𐲢𐳉𐳄 : 𐲐𐳙𐳦 -> 𐲐𐳙𐳦 -> 𐲐𐲛 ()
        𐳌𐳐𐳯𐳯𐲂𐳪𐳯𐳯𐲢𐳉𐳄 n maxn =
            if n > maxn then pure ()
            else do
                case 𐳍𐳉𐳦𐲥𐳟𐳙𐳉 (𐳘𐳛𐳇 n 3) (𐳘𐳛𐳇 n 5) of
                    𐲒𐳪𐳥𐳦 a => do
                        a
                        𐳦𐳢𐳬𐳓𐳐𐲢𐳐𐳇𐳀 ""
                    𐲦𐳬𐳏𐳐 => 𐳦𐳢𐳬𐳓𐳐 ""
                𐳌𐳐𐳯𐳯𐲂𐳪𐳯𐳯𐲢𐳉𐳄 (n + 𐳺) maxn
            where
                𐳍𐳉𐳦𐲥𐳟𐳙𐳉 : 𐲐𐳙𐳦 -> 𐲐𐳙𐳦 -> 𐲮𐳟𐳐𐳂𐳛𐳖𐳖𐳀 ( 𐲐𐲛 () )
                𐳍𐳉𐳦𐲥𐳟𐳙𐳉 0 0 = 𐲒𐳪𐳥𐳦 (𐳦𐳢𐳬𐳓𐳐 "𐳌𐳐𐳯𐳯𐲂𐳪𐳯𐳯")
                𐳍𐳉𐳦𐲥𐳟𐳙𐳉 0 _ = 𐲒𐳪𐳥𐳦 (𐳦𐳢𐳬𐳓𐳐 "𐲌𐳐𐳯𐳯")
                𐳍𐳉𐳦𐲥𐳟𐳙𐳉 _ 0 = 𐲒𐳪𐳥𐳦 (𐳦𐳢𐳬𐳓𐳐 "𐲂𐳪𐳯𐳯")
                𐳍𐳉𐳦𐲥𐳟𐳙𐳉 _ _ = 𐲦𐳬𐳏𐳐
